[
  {
    "id": 1,
    "title": "Suporte N1/N2",
    "titleEn": "Support N1/N2",
    "company": "Qualitare",
    "companyEn": "Qualitare",
    "location": "João Pessoa, PB",
    "locationEn": "João Pessoa, PB",
    "startDate": "Maio 2025",
    "endDate": null,
    "current": true,
    "description": [
      "Presto suporte técnico N1/N2 para os clientes da empresa, solucionando dúvidas e incidentes técnicos relacionados aos produtos e serviços oferecidos, garantindo alto nível de satisfação do cliente.",
      "Sou responsável por realizar o deploy de aplicações e sites em ambientes de produção, bem como configurar e gerenciar ambientes de homologação para testes e validações.",
      "Atuo na validação e homologação de novos produtos e serviços, certificando-se de que estejam aptos para publicação e uso pelos clientes.",
      "Realizo a criação de algumas páginas nos sites dos clientes.",
      "Utilizo Git, PHP, JavaScript, Wordpress, MySQL, Laravel"
    ],
    "descriptionEn": [
      "Provide technical support N1/N2 for clients of the company, assisting them with questions and technical problems related to the products and services of the company.",
      "I am responsible for deploying applications and websites in production environments, as well as configuring and managing homologation environments for tests and validations.",
      "I work in the validation and homologation of new products and services, ensuring that they are ready for publication and use by clients.",
      "I create some pages on the clients' websites.",
      "I use Git, PHP, JavaScript, Wordpress, MySQL, Laravel"
    ]
  },
  {
    "id": 2,
    "title": "Desenvolvedor FullStack",
    "titleEn": "FullStack Developer",
    "company": "Fabrica de Software - Unipê",
    "companyEn": "Software Factory - Unipê",
    "location": "João Pessoa, PB",
    "locationEn": "João Pessoa, PB",
    "startDate": "Set 2023",
    "endDate": "Jun 2024",
    "current": false,
    "description": [
      "No tempo que passei na Fabrica de Software, atuei como desenvolvedor Full-Stack, contribuindo para o desenvolvimento de um sistema de estoque para a farmacia universitaria Unipê.",
      "Liderei a equipe de desenvolvimento Back-end e Auxiliei a equipe de Front-end na construção de telas e na conexão com a API",
      "Colaborei ativamente em cerimônias ágeis, incluindo dailys, planejamento de sprints e revisões de código, seguindo a metodologia Scrum. Também utilizei Git para controle de versão e GitHub para colaboração em equipe.",
      "Ferramentas e tecnologias: React, Next.js, JavaScript, Java, Spring Boot, PHP, PostgreSQL, MySQL, Git, Postman, Figma e Scrum."
    ],
    "descriptionEn": [
      "During my time at the Software Factory, I worked as a Full-Stack developer, contributing to the development of a stock system for the university pharmacy Unipê.",
      "I led the Back-end development team and assisted the Front-end team in building screens and connecting to the API",
      "I actively participated in agile ceremonies, including dailys, sprint planning and code reviews, following the Scrum methodology. I also used Git for version control and GitHub for team collaboration.",
      "Tools and technologies: React, Next.js, JavaScript, Java, Spring Boot, PHP, PostgreSQL, MySQL, Git, Postman, Figma and Scrum."
    ]
  }
]
